<template>
  <div>
    <div
      v-for="(faq, index) in teacherFaqs"
      :key="index"
      class="l-content--detail__box"
    >
      <p class="u-text--big">
        {{ faq.title }}
      </p>
      <ul class="c-list--question">
        <li
          v-for="(body, content) in faq.bodys"
          :key="content"
        >
          <!-- eslint-disable vue/no-v-html -->
          <div
            class="question"
            v-html="body.question"
          />
          <div
            class="answer"
            :class="{open: body.isAnswerOpen}"
            v-html="body.answer"
          />
          <!-- eslint-enable -->
          <span
            class="toggleAnswerPanelButton"
            :class="{ rotate: body.isAnswerOpen }"
            @click.stop="toggleTeacherAnswer(index, content)"
          />
        </li>
      </ul>
    </div>
  </div>
</template>
<script>
	export default {
        components: {},
		data() {
			return {
				teacherFaqs: [
					{
						title: "レッスン開講のための準備",
						bodys: [
							{
								isAnswerOpen: false,
								question: "レッスンを始めるためには何が必要ですか？",
								answer: "レッスンを始めるために最低限必要なものは、インターネット環境、パソコンまたはタブレットまたはスマートフォンです（※可能であればパソコンがおすすめです）。パソコンをご利用の方はＷＥＢカメラとマイクが必要な場合もあります。<a href='' class='u-text--link'>パソコンにカメラがついているかどうか</a>の確認方法また、レッスン内容によっては、ヘッドセットまたはスピーカーなどがあると便利です。",
							},
							{
								isAnswerOpen: false,
								question: "どのWEB会議ツールを使用したら良いですか？",
								answer: "保留（サイト完成後仕様を確認して記載。中澤さんに確認の必要あり。）",
							},
							{
								isAnswerOpen: false,
								question: "レッスン開催前に生徒に資料や素材を渡すことはできますか？",
								answer: "はい、できます。生徒様への資料や素材の提供については、基本的にはメッセージ機能からのデータ添付にて行ってください。データ添付可能なファイルは下記になります。添付が不可能な素材については、市販教材購入の案内や郵送など必要に応じて手配してください。なお、他人の知的財産権を侵害する教材や素材の使用は認められません。弊社はこれらの権利の有無について一切関与いたしませんので、全て講師の責任で行ってください。",
							},
							{
								isAnswerOpen: false,
								question: "初めて講座を開設するのですが、はじめ方など教えてくれますか？",
								answer: "はい、まずはサイト内の<a href=''>講座開設方法</a>をご確認ください。<br>こちらのページをご覧いただいても解決しない場合は、弊社サポートまでご連絡ください。",
							},
							{
								isAnswerOpen: false,
								question: "生徒が集まらないときアドバイスはもらえますか？",
								answer: "はい、弊社のサポート担当が電話やZOOM、Skype等でアドバイスさせていただきます。<br>弊社では、まずはLINEやFacebook、Instagram等のSNSを利用した集客を推奨しています。SNSの開設方法もアドバイスさせていただきます。<r>また、チラシやHP等でも集客していきたい方には、割引価格でチラシ、HP制作を行っています。<br><a href=''>詳細はコチラ</a>",
							},
							{
								isAnswerOpen: false,
								question: "料金設定の目安などありますか？",
								answer: "ジャンルや内容により異なるので一概にはお答えできません。ただし、内容により独自性やオリジナル性が高いレッスンであれば高い料金設定の方もいらっしゃいます。レッスンの内容によって各講師の判断で設定していただければと思います。",
							},
						]
					},
					{
						title: "レッスン内容に関する質問",
						bodys: [
							{
								isAnswerOpen: false,
								question: "どのようなジャンルのレッスンを開講できますか？",
								answer: "ジャンルについては、特に規定はありません。講師規約第13条の禁止事項に該当しなければご自由にレッスンを開講していただけます。",
							},
							{
								isAnswerOpen: false,
								question: "ジャンルの違う講座を複数もつことは可能ですか？",
								answer: "可能です。当サイトでは、複数ジャンルで活躍されている講師もたくさんいらっしゃいます。",
							},
							{
								isAnswerOpen: false,
								question: "プロの講師でなくてもレッスンが開講できますか？",
								answer: "はい、可能です。弊社はマッチングサイトですので、受講者の需要にマッチしていればプロの講師でなくてもご自身の趣味や特技を生かしてレッスンを開講していただけます。講師規約第13条の禁止事項に該当する場合は開講できません。",
							},
						]
					},
					{
						title: "サイトを利用に関する質問",
						bodys: [
							{
								isAnswerOpen: false,
								question: "登録料、入会金、月額会費はかかりますか？",
								answer: "登録料、入会金、月額費用は一切かかりません。講師が弊社にお支払いいただく費用は、受講者がレッスンを受講した場合の手数料のみになります。登録しているだけの場合については、費用は発生しません。<br>※手数料については、講師規約11条参照",
							},
							{
								isAnswerOpen: false,
								question: "何日先のレッスンまで開講できますか？",
								answer: "レッスン開講時期については特に制限はありません。受講者とのこまめなやりとりが重要となりますので各講師の判断で、ご自身がスケジュール管理できる日にちまでのレッスンを開講してください。",
							},
							{
								isAnswerOpen: false,
								question: "レッスンは何個まで開講できますか？",
								answer: "レッスンの開講数につきましては、特に制限はありません。",
							},
							{
								isAnswerOpen: false,
								question: "講師側からレッスン時間変更やキャンセルはできますか？",
								answer: "やむを得ない事情がある場合は、レッスンの時間変更やキャンセルは可能です。ただし、クレームや評価につながる可能性がありますので、<span class='u-color--red'>受講者には講師が責任を持ってキャンセル及び変更の旨を連絡してください。</span><br>※講師キャンセルポリシー参照",
							},
							{
								isAnswerOpen: false,
								question: "しばらく講座を休止したいときはどうしたらよいですか？",
								answer: "講座の休止については、特に手続きは必要ありません。登録しているだけでは、費用は発生しませんので現在開講中の講座終了時点で新たに講座を開講しなければ、そのまま休止ということになります。",
							},
							{
								isAnswerOpen: false,
								question: "自己都合で講座を休む時はどうしたらよいですか？",
								answer: "講師キャンセルポリシーに従い、講師が責任を持って受講者に連絡してください。<br>※講師キャンセルポリシー参照",
							},
							{
								isAnswerOpen: false,
								question: "悪質なユーザーがいる場合、ブロックや受講予約の拒否はできますか？",
								answer: "悪質なユーザーのブロック機能はありませんが、講師が悪質なユーザーと判断した場合、レッスン開始日時の24時間前までであれば受講予約の拒否が可能です。<br>※講師キャンセルポリシー参照<br><br>また、悪質なユーザーがいる場合は、サイト運営者にご報告いただければ、運営者側の権限でユーザーを退会させることもあります。（受講者規約第9条参照）",
							},
							{
								isAnswerOpen: false,
								question: "レッスンの録画／録音しても良いのでしょうか？",
								answer: "はい、生徒様に了承を得たうえで、ご自身の閲覧用であれば可能です。録画機能がついておりますので録画ボタンで録画可能です。また、ご自身のビデオ等で録画していただいても大丈夫です。ただし、録画したものを他人に譲渡したり、別の媒体で公開・販売することは原則禁止します。例外として、ご自身の宣伝用で録音した動画をYoutubeやSNS等に公開したい場合は、生徒様の了承を得ること、おけいcomのURLを記載することを承認していただいた場合に限り公開可能です。その場合、使用している音楽等の著作権については、講師が責任を持って提供元に確認してください。その他の場合は弊社サポートにご相談ください。",
							},
							{
								isAnswerOpen: false,
								question: "キャンセル料は保障されていますか？",
								answer: "はい、レッスン契約成立後の受講者側の都合によるキャンセルの場合は、当社規定のキャンセルポリシー及び登録していただいた講師独自のキャンセルポリシーに従いキャンセル料金が発生します。<br>※生徒キャンセルポリシー参照",
							},
						]
					},
					{
						title: "設備に関する質問",
						bodys: [
							{
								isAnswerOpen: false,
								question: "書道や手芸、ピアノなど手もとを映したいときはどうしたらよいですか？",
								answer: "インで使用するデバイス（パソコン、タブレット、スマートフォン等）の他に別のカメラ（Webカメラ、タブレット、スマートフォン）を接続してください。そして、手元が映る位置を固定できるよう、三脚やモニタースタンド等をご用意ください。<br>※追記：Zoomでは2カメ設定できますが、Skypeでは２つのアカウントを用意して接続する必要があるので、サイトのシステムによって回答が少し調整する必要があります。",
							},
							{
								isAnswerOpen: false,
								question: "音楽を流したいときはどうしたらよいですか？",
								answer: "著作権によって守られている曲目、音源については、利用制限があります。著作物を使用する際には、管理団体へ利用許諾を申請する必要がありますので、ご自身でご確認ください。<br>なお、弊社はこれらの権利の有無について一切関与いたしませんので、全て講師の責任で行ってください。",
							},
						]
					},
					{
						title: "受講料に関する質問",
						bodys: [
							{
								isAnswerOpen: false,
								question: "レッスン料はいつどのような方法で受け取れますか？",
								answer: "レッスン料は、管理画面の請求ボタンを押すことで講師に支払われます。毎月月末締め、翌月15日（15日が銀行の非営業日である場合には直後の営業日）に弊社既定の手数料を差し引いた金額がご指定の口座に振り込まれます。請求ボタンが押されなかった場合は、受講料は翌月に持ち越されます。その際の振込手数料につきましては、該当月のレッスン料が１万円以上の場合は当社負担、１万円未満の場合は、講師側負担となります。レッスン料が１万円未満の場合は、レッスン料から弊社既定の手数料+振込手数料を差し引いた金額がご指定の口座に振り込まれます。<br>（講師規約第11条参照）",
							},
						]
					},
				],
			}
		},
		methods: {
			// 講師向けよくある質問ボタン
			toggleTeacherAnswer: function(index, content) {
				this.teacherFaqs[index].bodys[content].isAnswerOpen = !this.teacherFaqs[index].bodys[content].isAnswerOpen;
			},
		},
	}
</script>
