<template>
  <div>
    <div
      v-for="(faq, index) in studentFaqs"
      :key="index"
      class="l-content--detail__box"
    >
      <p class="u-text--big">
        {{ faq.title }}
      </p>
      <ul class="c-list--question">
        <li
          v-for="(body, content) in faq.bodys"
          :key="content"
        >
          <div
            class="question"
          >
            {{ body.question }}
          </div>
          <div
            class="answer"
            :class="{ open: body.isAnswerOpen }"
          >
            {{ body.answer }}
          </div>
          <span
            class="toggleAnswerPanelButton"
            :class="{ rotate: body.isAnswerOpen }"
            @click.stop="toggleStudentAnswer(index, content)"
          />
        </li>
      </ul>
    </div>
  </div>
</template>
<script>
	export default {
    components: {},
		data() {
			return {
				// 生徒のよくある質問
				studentFaqs: [
					{
						title: "レッスン開講のための準備",
						bodys: [
							{
								isAnswerOpen: false,
								question: "レッスンを受講するためには何が必要ですか？マイクやカメラは必要ですか？",
								answer: "レッスンを始めるために最低限必要なものは、インターネット環境、パソコンまたはタブレットまたはスマートフォンです（※可能であればパソコンがおすすめです）。パソコンをご利用の方はＷＥＢカメラとマイクが必要な場合もあります。<br>→<a href=''>パソコンにカメラがついているかどうかの確認方法</a>",
							},
							{
								isAnswerOpen: false,
								question: "当日にちゃんと接続できるか不安です。",
								answer: "レッスン当日にスムーズかつ安心してレッスンを受講するためには、事前に接続チェックを行うことをおすすめいたします。弊社サイトのガイダンス動画をご確認いただき、ご不明な点がある場合は、当社のサポートにお問合せください。",
							},
						]
					},
					{
						title: "レッスン内容に関する質問",
						bodys: [
							{
								isAnswerOpen: false,
								question: "体験レッスンはありますか？",
								answer: "こちらは各講師によって異なります。サイトのメッセージ機能より各講師にお問い合わせください。",
							},
							{
								isAnswerOpen: false,
								question: "レッスン申し込みの前に先生とやり取りはできますか？",
								answer: "はい、可能です。サイトのメッセージ機能より講師にお問い合わせください。",
							},
							{
								isAnswerOpen: false,
								question: "レッスンのリクエストができますか？",
								answer: "レッスンには、講師一人に対し複数が受講する形式のレッスンと完全マンツーマンのプライベートレッスンがあります。プライベートレッスンの場合は、受講者側の希望を講師にリクエストすることが可能です。",
							},
							{
								isAnswerOpen: false,
								question: "自分や部屋を映すのに抵抗があります。映さなくても受講はできますか？",
								answer: "はい、映さなくても受講は可能です。ですが、講師から適切なアドバイスを受けるには受講者側もカメラをオンにすることをおすすめします。",
							},
							{
								isAnswerOpen: false,
								question: "1台のパソコンやスマートフォンで家族や友人など複数で受講することはできますか？",
								answer: "原則は1人１アカウントでの参加をお願いしています。ただし、講師の方によっては可能な場合もございますので各講師にご相談ください。",
							},
							{
								isAnswerOpen: false,
								question: "小さな子どもがいても参加できますか？",
								answer: "はい、参加していただけます。ただし、複数人が受講するグループレッスンの場合は、自分が発言するとき以外はマイクをオフにするなどのご配慮をお願いします。プライベートレッスンの場合は、講師とご相談ください。",
							},
							{
								isAnswerOpen: false,
								question: "子どもも受講できますか？その際、親の付き添いはいりますか？",
								answer: "はい、お子様向けのレッスン、お子様1人で受講できる場合は可能です。年齢が小さく、親御様の付き添いが必要な場合は付き添っていただいて結構です。",
							},
						],
					},
					{
						title: "サイトを利用に関する質問",
						bodys: [
							{
								isAnswerOpen: false,
								question: "登録料、入会金、月額会費はかかりますか？",
								answer: "登録料、入会金、月額費用は一切かかりません。レッスンを受講する場合に限り、受講料がかかります。登録だけなら一切費用は発生しません。",
							},
							{
								isAnswerOpen: false,
								question: "ログインID、パスワードを忘れてしまいました。再発行できますか？",
								answer: "はい、再発行可能です。会員ログイン画面の「パスワードをお忘れの方」より再発行の手続きをお願いします。",
							},
							{
								isAnswerOpen: false,
								question: "何日前までに予約する必要がありますか？",
								answer: "※中澤さんに仕様確認をする<br>（※生徒キャンセルポリシー参照）",
							},
							{
								isAnswerOpen: false,
								question: "予約した後にキャンセルはできますか？",
								answer: "レッスン開始日の24時間前までであればキャンセル可能です。<br>（※生徒キャンセルポリシー参照）",
							},
							{
								isAnswerOpen: false,
								question: "予約した後にレッスン時間の変更はできますか？",
								answer: "講師1人に対して複数人が受講するグループレッスンの場合は、日時の変更ができませんのでキャンセルして新たにご都合のよい日時で予約していただく形になります。この場合、レッスン開始日の24時間前までであればキャンセル料がかかりませんが、レッスン開始日時まで24時間を切っている場合は、各講師規定のキャンセル料が発生します。<br>（※生徒キャンセルポリシー参照）<br>完全マンツーマンのプライベートレッスンの場合は、各講師とご相談ください。",
							},
							{
								isAnswerOpen: false,
								question: "レッスンに遅刻した場合はどうなりますか？",
								answer: "受講者は何らかの理由によりレッスンのキャンセル及び日時変更を行う場合は、その旨を講師に連絡することとなっております。当日受講者側の遅刻などの理由によりレッスンが受講できなかった場合は、受講料の返金はいたしかねますのでご了承ください。（受講者規約第15条参照）",
							},
							{
								isAnswerOpen: false,
								question: "キャンセル料はかかりますか？またキャンセル後の返金はどうなりますか？",
								answer: "レッスン開始日の24時間前までであればキャンセル料がかかりませんが、レッスン開始日時まで24時間を切っている場合は、各講師規定のキャンセル料が発生します。<br>（※生徒キャンセルポリシー参照）<br>キャンセル後の返金については、お支払いいただいた受講料から講師規定のキャンセル料を差し引いた金額をご利用いただいたお支払い方法にて返還いたします。受講料返還の際に振込手数料が発生する場合は、受講者側都合によるキャンセルの場合は、受講者の負担になります。",
							},
							{
								isAnswerOpen: false,
								question: "講座開始直前や講座途中に音が聞こえなくなる、接続が切れるなど急なトラブルがあり受講できなかったら返金してもらえますか？",
								answer: "講師側の設備機器トラブルによる場合は、受講者規約に従い受講料の返還請求ができます。（受講者規約第14条2項2号）<br>受講者側の設備機器トラブルによる場合は、受講料の返還はいたしかねます。",
							},
							{
								isAnswerOpen: false,
								question: "講師と連絡が取れない時はどうすればいいですか？",
								answer: "レッスン開始時間になっても講師と連絡がとれずにレッスンが受講できなかった場合については、受講料を返還いたしますので当社にご連絡ください。",
							},
							{
								isAnswerOpen: false,
								question: "レッスンの録画／録音しても良いのでしょうか？",
								answer: "はい、講師に了承を得たうえで、ご自身の閲覧用であれば可能です。録画機能がついておりますので録画ボタンで録画可能です。また、ご自身のビデオ等で録画していただいても大丈夫です。ただし、録画したものを他人に譲渡したり、別の媒体（YoutubeやSNS等）で公開・販売することは禁止します。",
							},
						]
					},
					{
						title: "設備に関する質問",
						bodys: [
							{
								isAnswerOpen: false,
								question: "スマートフォンで受講しているときに電話がかかってきたら映像は切断されますか？",
								answer: "お使いのスマートフォンのスペックやインターネットの接続状況によります。安心して受講していただくためにはパソコンやタブレットでの受講をおすすめします。",
							},
						]
					},
					{
						title: "受講料に関する質問",
						bodys: [
							{
								isAnswerOpen: false,
								question: "どのような支払方法がありますか？クレジットカードがないと入会できませんか？",
								answer: "現在支払い方法としてはクレジットカード及びその他当社が別途指定する方法となっています。（受講者規約第13条3項）<br>将来的には銀行振込、コンビニ決済及びその他の決済方法の導入を考えています。クレジットカードをお持ちでない場合は弊社のサポートにご相談ください。",
							},
							{
								isAnswerOpen: false,
								question: "領収書の発行はできますか？",
								answer: "基本的には、クレジットカード決済完了メール及びクレジットカード明細で代用していただいておりますが、どうしても必要な場合は弊社サポートまでご連絡ください。",
							},
						]
					},
				],
			}
		},
		created: function() {
			// 必要に応じて、初期表示時に使用するLaravelのAPIを呼び出すメソッドを定義
		},

		methods: {

			// 受講者向けよくある質問ボタン
			toggleStudentAnswer: function(index, content) {
				this.studentFaqs[index].bodys[content].isAnswerOpen = !this.studentFaqs[index].bodys[content].isAnswerOpen;
			},
		},

	}
</script>
