{{-- @extends('layouts.app')

@section('content')
    <div class="container">
        <div class="row justify-content-center">
            <div class="col-md-8">
                <h2>講師規約</h2>
            </div>
        </div>
    </div>
@endsection --}}

@extends('layouts.common')

<!-- タイトル・メタディスクリプション -->
@section('title', '講師規約')
@section('description', '講師規約')

<!-- CSS -->
@push('css')
@endpush

<!-- 本文 -->
@section('content')

<div class="l-wrap--main">
	<div class="l-page">
		<p>株式会社アイリック（以下、「当社」といいます。）が運営するサービスである「おけいcom」（https:// okeicom.com 以下、「本サービス」といいます。）は、以下の「講師規約」（以下、「本規約」といいます。）を承諾頂いた講師（後記第1条第1項第3号にて定義します。）にのみ提供させて頂くサービスです。講師は、あらかじめ本規約の内容に同意の上、本サービスを利用するものとします。</p>
		<ol class="term-list">
			<li>定義・本サービスの内容
				<ol>
					<li>本規約において、以下の各号の用語は、各号所定の意味を有するものとします。
						<ol class="non-number">
							<li>① 「レッスン」：各講師が提供するサービスに関連した情報の提供、アドバイス行為等の総称</li>
							<li>② 「受講者」：レッスンの受講を希望し、又は実際に受講する者</li>
							<li>③ 「講師」：レッスンの提供を希望し、又は実際に提供する者</li>
							<li>④ 「レッスン契約」：講師と受講者との間で締結されるレッスンの提供及び受講に関する契約</li>
							<li>⑤ 「受講料」：レッスン契約の対価として受講者が当社を介して講師に支払う料金</li>
							<li>⑥ 「手数料」：仲介サービスの対価として講師が当社に支払う料金</li>
							<li>⑦ 「当社サイト」：当社が運営する最新のウェブサイト</li>
						</ol>
					</li>
					
					<li>本サービスは、以下の各号のサービスをその内容とします。
						<ol class="non-number">
							<li>① 受講者によるレッスンの検索、レッスン契約の申込、申込済みのレッスン契約の管理等を容易にするサービス</li>
							<li>② マッチングサービス</li>
							<li>③ 受講者に対して前各号のサービスに関するカウンセリングを行うサービス</li>
							<li>④ 受講者に対してレッスンを行うサービス</li>
							<li>⑤ 受講者に対して電子メールにて定期的又は不定期的に当社サイトの更新情報、キャンペーン情報その他当社が別途定める情報の配信を行うサービス（以下、「メールマガジンサービス」といいます。）</li>
							<li>⑥ 講師による受講者からのレッスン契約の申込に対する承諾を容易にするサービス</li>
							<li>⑦ その他、当社が別途定めるサービス</li>
						</ol>
					</li>
				</ol>
			</li>
				
			<li>規約の適用
				<ol>
					<li>本規約は、講師による本サービスの利用について適用されるものとします。</li>
					<li>本規約とは別に当社が定める利用規約及び諸規定並びに当社サイト上での掲示を含む当社が第3条に基づき講師に対して発する一切の通知（以下、総称して「当社が定める利用規約等」といいます。）は、それぞれ本規約の一部を構成するものとします。</li>
					<li>本規約の規定と前項の利用規約、諸規定、通知の内容が異なる場合には、当該通知、当該諸規定、当該利用規約、本規約の順で優先して適用されるものとします。なお、当社サイト上での掲示による通知とその他の方法による通知の内容が異なる場合には、後に通知されたものが優先して適用されるものとします。</li>
					<li>受講者による本サービスの利用については、当社が別途定める受講者規約（以下、「受講者規約」といいます。）が適用されるものとします。</li>
					<li>本規約における日時は、日本の標準時刻に従うものとします。</li>
				</ol>
			</li>
			
			<li>当社からの通知
				<ol>
					<li>当社は、当社サイト上での掲示、電子メールの送信、文書の送付その他当社が適当と判断する方法により、講師に対し、随時当社が必要と判断する事項を通知するものとします。</li>
					<li>前項の通知は、当社が前項の通知を当社サイト上での掲示、電子メールの送信又は文書の送付により行った場合は、当社が当社サイト上に掲示し、電子メールを発信し、又は文書を発送した時点からその効力を生じるものとします。</li>
				</ol>
			</li>
			
			<li>本サービスの利用資格<br>講師が本サービスを利用するには、以下の各号の条件にいずれも該当する必要があるものとします。
				<ol>
					<li>20歳以上で、法的責任能力があること</li>
					<li>居住国及び籍を置く国において、就業が許されていること</li>
				</ol>
			</li>
			
			<li>本サービスの利用に関して
				<ol>
					<li>講師は、当社から提供される情報の真実性、正確性、確実性、信頼性、有用性等その他本サービスの品質、正確性、確実性、信頼性、有用性等については自ら判断するものとし、これらを自己の責任において利用することにあらかじめ同意するものとします。</li>
					<li>当社は、講師を雇用するものではなく、講師は、当社と講師との間に雇用に関する契約が一切成立しないことにあらかじめ同意するものとします。</li>
					<li>当社は、講師が安心してレッスンの提供ができるよう、当サイトの安全の確保に全力を尽くしますが、それを保障することはしないものとします。</li>
					<li>講師は、本サービスを利用するにあたり、常に、受講者のことを最優先に考え、良識で考えられる範囲で、最善の対応を心がけるものとします。</li>
					<li>当社は、受講者が円滑、且つ満足にレッスンの授与ができるよう、全力を尽くします。その為、講師の提供するレッスンや、その実施に伴う事前のやりとり、カスタマーサービスの質が、本条4号にて求められる水準に達していないと当社が判断した場合、当社の裁量で、講師への予告なく、受講者へ受講料の返還を行えるものとします。また、講師の、受講者への接客態度・対応やカスタマーサービスについての考え方が、当社が求める水準と著しく異なる場合、当社の裁量で、該当する講師の登録を抹消することができるものとします。</li>
					<li>レッスンは原則として講師により提供されるものとし、当社は、当社が別途必要と認めた場合を除いては、レッスンを提供しないものとします。</li>
					<li>当社は、講師により提供されるレッスン及び講師と受講者との間において相互に提供される情報の査定又は管理を行う義務を負わないものとします。</li>
					<li>当社は、講師及び受講者の身元情報その他講師及び受講者が掲示する諸情報の真実性、確実性、信頼性、有益性等については、一切保証しないものとします。</li>
					<li>当社は、講師が本サービスに関連して法令に違反する行為を行ったとしても、一切の責任を負わないものとします。</li>
					<li>当社は、受講者と講師との間で相互に提供されるいかなる情報、ファイル及び物品等について一切責任を負わないものとし、受講者は、これらの情報、ファイル又は物品等の提供によって受講者に生じたいかなる種類の損害又は損失等からも当社を免責することにあらかじめ同意するものとします。</li>
					<li>講師は、当社が別途認める場合を除き、受講者に対し、マッチングサービスにより締結されたレッスン契約の履行以外の目的で情報、ファイル及び物品等を提供してはならないものとします。</li>
				</ol>
			</li>

			<li>他の講師等とのトラブル<br>講師は、万が一、他の受講者、講師その他の第三者から何らかの被害や迷惑を被る等、講師と他の講師、受講者その他の第三者との間でトラブルが生じた場合には、自己の責任と費用をもってその処理解決を図るものとし、当該トラブルに関連して当社が損害を被った場合には、その全ての損害（合理的な弁護士費用を含みますがこれに限りません。）を直ちに賠償する責任を負うものとします。なお、当社が当該トラブルを処理解決した場合には、その処理解決に要した全ての費用（合理的な弁護士費用を含みますがこれに限りません。）は、講師の負担とします。</li>
			<li>講師登録
				<ol>
					<li>講師は、自ら当社サイト上の講師登録ページの入力フォームに自己の氏名、性別、電子メールアドレス、希望パスワード、居住国その他当社が別途指定する情報を入力し、これを当社に送信する方法その他当社が別途指定する方法により講師登録申込（以下、「講師登録申込」といいます。）を行うものとします。なお、講師は、講師登録申込を第三者に行わせてはならないものとし、また、講師登録申込の際、虚偽の内容を入力してはならないものとします。</li>
					<li>当社は、講師に対し、講師登録申込を承諾する旨の電子メールを送信する方法その他当社が別途定める方法により講師登録申込を承諾するものとします。</li>
					<li>当社は、以下の各号のいずれかに該当する場合、その理由を開示することなく、講師登録申込を承諾しないことができるものとします。
						<ol class="non-number">
							<li>① 講師登録申込が講師以外の第三者により行われたことが判明した場合（但し、当社が別途認める場合を除きます。）</li>
							<li>② 講師登録申込時に入力された内容に虚偽、誤記、入力漏れがあったことが判明した場合</li>
							<li>③ その他、講師登録申込を承諾することが不適切であると当社が判断した場合</li>
						</ol>
					</li>
					<li>講師は、講師登録申込時に入力した氏名、電子メールアドレス、居住国その他当社が別途指定する情報に変更が生じた場合、当社が別途定める方法により直ちに当社に届け出るものとします。</li>
					<li>講師は、当社が別途定める手続により自ら講師登録を抹消することができるものとします。ただし、既に確定したレッスン予定がある場合には、その限りではありません。</li>
				</ol>
			</li>
			
			<li>本サービス提供の停止・当社による講師登録の抹消<br>当社は、講師が以下の各号のいずれかに該当する場合、事前に通知することなく、当該講師に対する本サービスの提供を停止し、又は講師登録の抹消を行うことができるものとします。
				<ol class="non-number">
					<li>① 過去に本規約違反等により講師登録の抹消処分等を受けていたことが判明した場合</li>
					<li>② 第13条各号に定める行為を行った場合</li>
					<li>③ 前二号に定める他、本規約に違反した場合</li>
					<li>④ 受講者への接客姿勢や、レッスンの提供における考え方が、第5条4号にて求められる水準に満たないと判断された場合</li>
					<li>⑤ その他、本サービスを提供し、又は講師登録を維持することが不適切であると当社が判断した場合</li>
				</ol>
			</li>
			
			<li>パスワードの管理・使用等
				<ol>
					<li>講師は、当社が講師に発行したパスワード（以下、「パスワード」といいます。）の管理及び使用について一切の責任を負うものとし、当社はパスワードの管理について一切の責任を負いません。</li>
					<li>講師は、当社が別途認める場合を除き、パスワードを第三者に譲渡、貸与若しくは開示し、又は使用させてはならないものとします。</li>
					<li>パスワードの使用上の過誤又は第三者の不正使用等による不利益、損害、改ざん等については、当該パスワードを保有する講師が一切の責任を負うものとし、当社は一切の責任を負わないものとします。</li>
					<li>講師は、パスワードが第三者により無断で使用される等の不正使用がなされていることを発見した場合、当社へ直ちに連絡するものとし、当社から指示がある場合はこれに従うものとします。</li>
				</ol>
			</li>
			
			<li>費用負担
				<ol>
					<li>講師は、本サービスを利用し、又はレッスンを提供するために必要なハードウェア（PC、ヘッドセット、マイク、イヤホン等を含みますがこれらに限りません。）、ソフトウェア（後記第18条第1項に定める通話ソフトウェアを含みますがこれに限りません。）、通信回線その他の一切を自己の責任と費用をもって準備するものとします。</li>
					<li>講師は、本サービスの利用又はレッスンの提供には、前項に定める他、電話代等の通信費用、インターネットへの接続費用、電気代その他の費用がかかることを了承し、これを負担するものとします。</li>
				</ol>
			</li>
			
			<li>受講料について
				<ol>
					<li>講師は、当社が講師に代わって受講者から受講料を徴収する権限、又は受講者から徴収した受講料を返還するために必要な一切の権限を当社に付与するものとします。</li>
					<li>受講者から支払われた受講料は、弊社が管理し、講師側から請求ボタンにより受講料の支払い請求が行われた場合に受講料から弊社既定の手数料をさしい引いた金額を講師に支払うこととします。<br>講師が当社に支払う手数料は下記に定める通りです。
						<ol class="non-number">
							<li>～100,000円までの部分　25%</li>
							<li>100,000円超～150,000円未満　23%</li>
							<li>150,000円超～200,000円未満　20%</li>
							<li>200,000円超～250,000円未満　18%</li>
							<li>250,000円超～300,000円未満　15%</li>
							<li>300,000円超～　13%</li>
						</ol>
					</li>
					<li>受講料の支払いは、毎月月末を締め日として、支払い請求が行われた場合に翌月15日（15日が銀行の非営業日である場合には直後の営業日）に、当月分の受講料（弊社既定の手数料を差し引いた金額）を講師が別途指定し当社が事前に承認した銀行口座に振込送金の方法により送金するものとします。なお、当該振込に必要な手数料は該当月の受講料が１万円以上の場合は当社が負担するものとし、１万円未満の場合は講師が負担するものとします。受講料の請求が行われなかった場合の受講料は、翌月に持ち越されます。</li>
					<li>前項の定めにかかわらず、当社は、以下の各号のいずれかに該当する場合、受講料の送金を留保することができるものとします。
						<ol class="non-number">
							<li>① 受講者から当社に受講料の返還請求がなされた場合</li>
							<li>② レッスン契約で定められていたレッスン時間のうち累計20％に相当する時間分のレッスンの遂行が妨げられた場合又はその可能性があると当社が判断した場合</li>
							<li>② 講師が本規約に違反し、又は違反している可能性があると当社が判断した場合</li>
							<li>③ 本条第4項に定める銀行口座その他講師が当社に届け出た情報に誤り又は不足等があるために当社が受講料の支払を行うことができない場合</li>
							<li>④ その他、当社が受講料の支払を留保する必要があると判断した場合</li>
						</ol>
					</li>
					<li>前項④の理由により、受講料の送金ができない場合、あるいは支払をしたにも関わらず口座情報の間違い・不足等により受講料が当社に返却された場合、送金日から１ヶ月以内の再請求の場合に限り、再度送金手続きを行うものとする。なお、再度送金を行う場合には、当社指定の送金のための手数料を差し引いて送金を行うものとする。</li>
					<li>受講者規約及び当社が別途定める「キャンセルポリシー（受講者向け）」の定めに基づき当社が受講者からの受講料の返還請求に応じた場合、受講者の講師に対する受講料の支払義務及び当社の講師に対する受講料の送金義務は消滅するものとし、当該受講料が送金済みの場合は、講師は直ちに当該送金済みの受講料に相当する金額を当社に返還するものとします。</li>
				</ol>
			</li>
			

			<li>レッスン契約
				<ol>
					<li>レッスン契約は、受講者によるレッスン契約の申込に対し、講師が本サービス上のシステムを利用して当該申込を承諾する旨の電子メールを送信した時点で成立するものとします。</li>
					<li>講師は、当社が別途定める「キャンセルポリシー（受講者向け）」に基づき受講者がレッスン契約の申込又は成立後のレッスン契約をキャンセルすることができることにあらかじめ同意するものとします。</li>
					<li>講師が受講者から受けたレッスン契約の申込の拒否の可否、成立後のレッスン契約のキャンセル又は時間変更の可否、成立後のレッスン契約をキャンセルした場合の取扱等については、当社が別途定める「キャンセルポリシー（講師向け）」に従うものとします。</li>
					<li>当社は、以下の各号のいずれかに該当する事態又は該当すると見込まれる事態が発生した場合、講師に対し、当社が必要と判断する情報の提供を請求することができるものとし、講師は当該請求に直ちに応じなければならないものとします。</li>
					<ol class="non-number">
						<li>① 講師又は受講者が成立後のレッスン契約をキャンセルした場合</li>
						<li>② 第11条第6項に該当する場合</li>
						<li>③ その他、当社が必要と判断した場合</li>
					</ol>
				</ol>
			</li>
			
			<li>禁止事項
				<ol>
					<li>講師は、本サービスの利用又はレッスンの提供に関連して、以下の行為を行わないものとします。
						<ol class="non-number">
							<li>① 法律又は医療に関する助言等、資格、許可、認可、登録、ライセンス等が必要なレッスンその他のサービスを資格、許可、認可、登録、ライセンス等を得ていないにも関わらず提供する行為</li>
							<li>② 犯罪や差別に関する内容を含むレッスンその他のサービスの提供その他犯罪に結びつく行為</li>
							<li>③ 公序良俗に反する内容のレッスンその他のサービスの提供</li>
							<li>④ わいせつ又は児童虐待にあたる言動、行為、画像、文書等を送信又は掲示する行為</li>
							<li>⑤ 物品の売買等レッスンの提供以外の目的で本サービスを利用する行為</li>
							<li>⑥ 他の講師、受講者その他第三者若しくは当社の財産、プライバシー、肖像権若しくはパブリシティ権を侵害する行為又は侵害するおそれのある行為</li>
							<li>⑦ 事実に反する情報を送信又は掲示する行為</li>
							<li>⑧ 本サービスにより利用しうる情報を改ざん又は消去する行為又はそれを試みる行為</li>
							<li>⑨ 他の講師、受講者その他の第三者若しくは当社の著作権、商標権等の知的財産権を侵害する行為又は侵害するおそれのある行為</li>
							<li>⑩ 他の講師、受講者その他の第三者若しくは当社を差別若しくは誹謗中傷し、又は他の講師、受講者その他の第三者若しくは当社の名誉若しくは信用を傷つける行為</li>
							<li>⑪ 他の講師、受講者その他の第三者若しくは当社に対して無断で広告、宣伝、勧誘等の電子メールを送信する行為、受信者が嫌悪感を抱く電子メールを送信する行為、他者の電子メール受信を妨害する行為、連鎖的な電子メール転送を第三者に依頼する行為又は当該依頼に応じて電子メールの転送を行う行為</li>
							<li>⑫ 宗教、政治結社、マルチ商法等の勧誘を目的とする行為。</li>
							<li>⑬ 選挙運動若しくはこれに類似する行為又は公職選挙法に違反する行為</li>
							<li>⑭ コンピュータウイルス等有害なプログラムを使用若しくは提供する行為又は推奨する行為</li>
							<li>⑮ 他の講師、受講者その他の第三者になりすまして、本サービスを利用する行為</li>
							<li>⑯ 本サービスに接続されている他のコンピュータシステム又はネットワークへの不正アクセスを試みる行為</li>
							<li>⑰ 暴力的な要求行為、もしくは法的な責任を超えた不当な要求行為</li>
							<li>⑱ 取引に関して、脅迫的な言動をし、又は暴力を用いる行為</li>
							<li>⑲ 風説を流布し、偽計を用い又は威力を用いて相手方の信用を毀損し、又は相手方の業務を妨害する行為</li>
							<li>⑳ 前各号に定める他、法令若しくは公序良俗に反する行為（売春、暴力、残虐行為等を含みますがこれらに限りません。）又は他の講師、受講者その他の第三者若しくは当社に不利益を与える行為</li>
							<li>㉑ 他の講師、受講者その他の第三者に対して本サービスと競合し、又は競合する可能性のあるサービスを紹介、斡旋等する行為</li>
							<li>㉒ 本サービスと競合、又は競合する可能性のある第三者に、講師として知り得た、本サービスに関する情報を提供する行為</li>
							<li>㉓ 前各号に定める行為を助長又は促進する行為</li>
							<li>㉔ その他、当社が不適切と判断した行為</li>
						</ol>
					</li>
					<li>講師は、講師登録中はもちろん講師登録抹消後であっても、本サービスに関連して知り得た受講者に関する情報を本サービスの利用及びマッチングサービスにより締結されたレッスン契約の履行以外の目的に使用してはならず、当該情報に含まれる受講者に対してマッチングサービスを利用することなく直接のレッスンの申込等を一切行ってはならないものとします。</li>
				</ol>
			</li>
			
			<li>講師の責任<br>講師は、当社に対し、以下の各号に定める事項を表明及び保証するとともに、講師が以下の各号に定める事項に違反したとしても、当社には一切の責任がないことにあらかじめ同意するものとします。
				<ol class="non-number">
					<li>① 講師が本サイト上にアップロードしている情報その他講師が当社に届け出ている情報が正確かつ最新の情報であること</li>
					<li>② 講師が受講者に提供する情報及びレッスンの真実性、正確性、信頼性、有用性等</li>
					<li>③ レッスン契約において受講者と合意した内容（レッスン内容、レッスン時間を含みますがこれらに限りません。）を履行すること</li>
					<li>④ 当社から受け取った受講料について、講師の出身国及び居住国の法令等に従い自ら全ての責任を負って税金や税金支払の手続等に対応すること</li>
				</ol>
			</li>
			
			<li>電子メール・アップロードされた情報等
				<ol>
					<li>当社は、講師、受講者その他の第三者が作成した電子メール又はアップロードされた情報等の内容については、一切の責任を負わないものとします。</li>
					<li>講師の電子メール送信、情報等のアップロード、電子メールのサービスプロバイダとの対応及び当該対応に関連する他の条件、保証又は表明については、講師が一切の責任を負うものとし、講師は、当該対応の結果としてのいかなる種類の損害又は損失等から当社を免責することに同意するものとします。</li>
				</ol>
			</li>
			
			<li>秘密情報等の取扱
				<ol>
					<li>講師は、講師登録申込の際その他当社が別途指定する機会に、本サービスの利用及びレッスンの提供に必要な情報として当社が別途指定する講師の個人情報その他講師に関する情報（以下、「個人情報等」といいます。）を当社に提供するものとします。当社は、個人情報等のうち当社が別途入力フォーム等において受講者に知らせる目的で本サイト上に掲示することを明示した上で当該掲示を行うことにつき講師からあらかじめ同意を得た情報を、本サイト上に掲示するものとします。</li>
					<li>本規約に特に定める他、講師は、講師登録中はもちろん講師登録抹消後であっても、本サービスの利用又はレッスンの提供に関連して得られた他の講師、受講者その他の第三者及び当社に関する一切の情報（以下、「秘密情報」といいます。）について、その秘密を厳重に保持するものとし、方法の如何を問わず、これを第三者に開示あるいは漏洩し、また、本サービスの利用及びマッチングサービスにより締結されたレッスン契約の履行以外の目的のために使用してはならないものとします。</li>
					<li>講師は、当社が要求した場合又は講師登録が抹消された場合、当社の指示に従い、直ちに当社から受領した情報、ファイル、物品等の一切を返却又は廃棄しなければならないものとします。</li>
					<li>講師は、他の講師に対し、本サービスを利用してレッスンの内容に関する情報を提供してはならないものとします。但し、本条第1項に基づき本サイト上に掲示される情報についてはこの限りではないものとします。</li>
					<li>本規約に特に定める他、講師は、レッスンフィーに関する情報及び本サービスと競合し、又は競合する可能性のあるサービスに関する情報を他の講師、受講者その他の第三者に提供してはならないものとします。</li>
				</ol>
			</li>
			
			<li>ライセンス権の許諾<br>講師は、当社に対し、講師が当社サイトのプロフィールページその他のウェブページにアップロードした情報（これらの情報から発生又は派生する情報を含みますがこれに限りません。）を全世界で使用、公開、表示、再生、修正、翻訳、配布、削除等するサブライセンス権付き非独占的ライセンス権を、無償かつ永続的に許諾するものとします。なお、本条本文に基づき当社が講師からライセンス権の許諾を受ける情報には、テキスト、写真、絵画、音楽、評価を含め講師が当社サイトのプロフィールページその他のウェブページにアップロードした個人情報以外の全ての情報が含まれるものとします。</li>
			<li>通話ソフトウェアの利用　※サイト仕様確認後見直し必要
				<ol>
					<li>講師は、レッスンを提供する際、第三者の提供する当社指定のオンライン通話ソフトウェア（以下、「通話ソフトウェア」といいます。）を使用するものとします。</li>
					<li>講師は、通話ソフトウェアを使用する際には、通話ソフトウェアを提供する第三者の定める利用規約、使用条件その他の定めに従うものとします。</li>
					<li>講師は、講師登録を行う前に、あらかじめ通話ソフトウェアをダウンロードし、講師の環境下で通話ソフトウェアが使用可能かどうかを確認しなければならないものとします。</li>
					<li>当社は、講師の環境下で通話ソフトウェアが使用できなかったこと、通話ソフトウェアの使用に必要なハードウェアの故障及び設定不備その他講師側の事由により講師がレッスンを提供できなかったとしても、一切の責任を負わないものとします。</li>
				</ol>
			</li>
			
			<li>非保証・免責
				<ol>
					<li>当社は、本サービスにおいて提供する情報の真実性、正確性、確実性、信頼性、有用性等その他本サービス及びレッスンの品質、信頼性、有用性等について、いかなる保証も行わないものとし、受講者がこれらに関連して被った損害又は損失等について、一切の責任を負わないものとします。</li>
					<li>当社は、本サービスの提供の停止、受講者登録の抹消、本サービスの中断、変更、追加、廃止等により受講者が被った損害又は損失等について、一切の責任を負わないものとします。</li>
					<li>当社は、講師が他の講師を含む第三者の作為又は不作為により被った損害又は損失等について、一切の責任を負わないものとします。</li>
					<li>本規約に特に定める他、当社は、本サービスの利用に関連して講師が被った損害又は損失等について、一切の責任を負わないものとします。</li>
					<li>当社は、講師が本サービスの利用に関連して他の講師、受講者その他の第三者に与えた損害又は損失等について、一切の責任を負わないものとします。</li>
				</ol>
			</li>
			
			<li>広告主等との関係
				<ol>
					<li>講師は、本サイト内に掲載される広告の広告主その他の事業者（以下、「広告主等」といいます。）の販促活動に参加する場合、講師と広告主等との間において生じるトラブル等については、全て講師と広告主等との間で処理解決されるべきものであることに同意するものとします。</li>
					<li>当社は、広告主等が設置するリンク、広告主等が運営するウェブサイト又は本サービス若しくはソフトウェアの使用により講師が接触し連絡する者を含む第三者によるあらゆる行為について一切の責任を負わないものとします。</li>
					<li>講師は、広告主等その他の第三者が講師に与えたいかなる損害又は損失等についても、当社を免責することにあらかじめ同意するものとします。</li>
				</ol>
			</li>
			
			<li>本サービス提供の中断<br>当社は、次のいずれかに該当する場合には、講師に事前に通知することなく、本サービスの提供を一時的に中断することができるものとします。
				<ol class="non-number">
					<li>① 本サービス用設備の保守又は工事のため、やむを得ない場合</li>
					<li>② 本サービス用設備に障害が発生し、やむを得ない場合</li>
					<li>③ 電気通信事業者の提供する電気通信役務に起因して電気通信サービスの利用が不能になった場合</li>
					<li>⑤ その他、運用上又は技術上当社が本サービスの一時的中断が必要と判断した場合</li>
				</ol>
			</li>
			
			<li>本サービスの内容の変更・追加<br>当社は、講師に事前に通知することなく、本サービスの内容を変更又は追加することができるものとします。</li>
			<li>本サービスの廃止<br>当社は、講師に通知することにより、本サービスを廃止することができるものとします。</li>
			<li>権利の帰属<br>当社が本サービスにおいて提供する情報等（映像、音声、文章、写真、画像等を含みますがこれらに限りません。）に関する著作権、商標権等の知的財産権、肖像権、パブリシティ権その他一切の権利は、別段の定めがない限り、全て当社に帰属するものとします。</li>
			<li>本規約等の改定
				<ol>
					<li>当社は、講師の承諾を得ることなく、本規約、当社が定める利用規約等を改定することができるものとします。</li>
					<li>改定後の本規約、当社が定める利用規約等は、当社が講師に対してその改定内容を通知した時点から第3条第2項に従いその効力を生じるものとします。</li>
				</ol>
			</li>
			
			<li>損害賠償<br>本規約に特に定める他、講師は、本規約に違反したことにより、又は故意若しくは過失により、当社に損害を与えた場合、当社に対し、その全ての損害（合理的な弁護士費用を含みますがこれに限りません。）を直ちに賠償する責任を負うものとします。</li>
			<li>権利義務の移転・担保提供の禁止<br>講師は、本規約に基づく権利義務の全部若しくは一部を第三者に譲渡若しくは承継し、又は担保に供してはならないものとします。</li>
			<li>反社会的勢力の排除<br>講師は、次の各号のいずれか一にも該当しないことを表明し、かつ将来にわたっても該当しないことを表明し、保証するものとします。
				<ol class="non-number">
					<li>① 自らが、暴力団、暴力団員、暴力団員でなくなった時から5年を経過しない者、暴力団準構成員、暴力団関係企業、総会屋、社会運動等標ぼうゴロ又は特殊知能暴力集団等その他これらに準じる者（以下、総称して「暴力団員等」といいます）であること</li>
					<li>② 暴力団員等が経営を支配していると認められる関係を有すること</li>
					<li>③ 暴力団員等が経営に実質的に関与していると認められる関係を有すること</li>
					<li>④ 自ら若しくは第三者の不正の利益を図る目的又は第三者に損害を加える目的をもってするなど、暴力団員等を利用していると認められる関係を有すること</li>
					<li>⑤ 暴力団員等に対して資金等を提供し、又は便宜を供与するなどの関与をしていると認められる関係を有すること</li>
					<li>⑥ 自らの役員又は自らの経営に実質的に関与している者が暴力団員等と社会的に非難されるべき関係を有すること</li>
				</ol>
			</li>
			
			<li>準拠法<br>本規約に関する準拠法は、日本法とします。</li>
			<li>管轄裁判所<br>講師及び当社は、本サービスに関連して講師と当社との間又は受講者と講師との間で訴訟の必要が生じた場合、その訴額に応じて京都地方裁判所を第一審の専属的合意管轄裁判所とすることに合意するものとします。</li>
			<li>存続条項<br>講師登録抹消後といえども、第2条、第3条、第5条第1項ないし第3項、同条第5項ないし第8項、第6条、第9条、第10条、第11条第2項、同条第3項、同条第6項、第12条、第14条ないし第17条、第18条第4項、第19条、第20条、第24条、第26条ないし本条の各規定はなお有効に存続するものとします。</li>
			<li>協議解決<br>本規約に定めのない事項又は本規約の解釈について疑義が生じた事項については、講師と当社とで誠意をもって協議の上、解決にあたるものとします。</li>
		</ol>
		<p class="u-mt30">2020年10月1日　制定・施行</p>
	</div>
</div>

@endsection