{{-- @extends('layouts.app')

@section('content')
    <div class="container">
        <div class="row justify-content-center">
            <div class="col-md-8">
                <h2>受講者規約</h2>
            </div>
        </div>
    </div>
@endsection
 --}}




@extends('layouts.common')

<!-- タイトル・メタディスクリプション -->
@section('title', '受講者規約')
@section('description', '受講者規約')

<!-- CSS -->
@push('css')
@endpush

<!-- 本文 -->
@section('content')

<div class="l-wrap--main">
	<div class="l-page">
		<p>株式会社アイリック（以下、「当社」といいます。）が運営するサービスである「おけいcom」 （https:// okeicom.com 以下、「本サービス」といいます。）は、以下の「受講者規約」（以下、「本規約」といいます。）を承諾頂いた受講者（後記第1条第1項第2号にて定義します。）にのみ提供させて頂くサービスです。受講者は、あらかじめ本規約の内容に同意の上、本サービスを利用するものとします。</p>
		<ol class="term-list">
			<li>定義・本サービスの内容
				<ol>
					<li>本規約において、以下の各号の用語は、各号所定の意味を有するものとします。
						<ol class="non-number">
							<li>① 「レッスン」：各講師が提供するサービスに関連した情報の提供、アドバイス行為等の総称</li>
							<li>② 「受講者」：レッスンの受講を希望し、又は実際に受講する者</li>
							<li>③ 「講師」：レッスンの提供を希望し、又は実際に提供する者</li>
							<li>④ 「レッスン契約」：講師と受講者との間で締結されるレッスンの提供及び受講に関する契約</li>
							<li>⑤ 「受講料」：レッスン契約の対価として受講者が当社を介して講師に支払う料金</li>
							<li>⑥ 「手数料」：仲介サービスの対価として講師が当社に支払う料金</li>
							<li>⑦ 「当社サイト」：当社が運営する最新のウェブサイト</li>
						</ol>
					</li>
					
					<li>本サービスは、以下の各号のサービスをその内容とします。
						<ol class="non-number">
							<li>① 受講者によるレッスンの検索、レッスン契約の申込、申込済みのレッスン契約の管理等を容易にするサービス</li>
							<li>② マッチングサービス</li>
							<li>③ 受講者に対して前各号のサービスに関するカウンセリングを行うサービス</li>
							<li>④ 受講者に対してレッスンを行うサービス</li>
							<li>⑤ 受講者に対して電子メールにて定期的又は不定期的に当社サイトの更新情報、キャンペーン情報その他当社が別途定める情報の配信を行うサービス（以下、「メールマガジンサービス」といいます。）</li>
							<li>⑥ 講師による受講者からのレッスン契約の申込に対する承諾を容易にするサービス</li>
							<li>⑦ その他、当社が別途定めるサービス</li>
						</ol>
					</li>
				</ol>
			</li>
				
			<li>規約の適用
				<ol>
					<li>本規約は、受講者による本サービスの利用について適用されるものとします。</li>
					<li>本規約とは別に当社が定める利用規約及び諸規定並びに当社サイト上での掲示を含む当社が第3条に基づき受講者に対して発する一切の通知（以下、総称して「当社が定める利用規約等」といいます。）は、それぞれ本規約の一部を構成するものとします</li>
					<li>本規約の規定と前項の利用規約、諸規定、通知の内容が異なる場合には、当該通知、当該諸規定、当該利用規約、本規約の順で優先して適用されるものとします。なお、当社サイト上での掲示による通知とその他の方法による通知の内容が異なる場合には、後に通知されたものが優先して適用されるものとします。</li>
					<li>講師による本サービスの利用については、当社が別途定める講師規約（以下、「講師規約」といいます。）が適用されるものとします。</li>
					<li>本規約における日時は、日本の標準時刻に従うものとします。</li>
				</ol>
			</li>
			
			<li>当社からの通知
				<ol>
					<li>当社は、当社サイト上での掲示、電子メールの送信、文書の送付その他当社が適当と判断する方法により、受講者に対し、随時当社が必要と判断する事項を通知するものとします。</li>
					<li>前項の通知は、当社が前項の通知を当社サイト上での掲示、電子メールの送信又は文書の送付により行った場合は、当社が当社サイト上に掲示し、電子メールを発信し、又は文書を発送した時点からその効力を生じるものとします。</li>
				</ol>
			</li>
			
			<li>本サービスの利用資格<br>受講者が未成年者の場合、本サービスの利用については、親権者又は後見人の同意を得なければならないものとします。</li>
			
			<li>本サービスの利用に関して
				<ol>
					<li>受講者は、当社から提供される情報の真実性、正確性、確実性、信頼性、有用性等その他本サービスの品質、正確性、確実性、信頼性、有用性等については自ら判断するものとし、これらを自己の責任において利用することにあらかじめ同意するものとします。</li>
					<li>受講者は、講師により提供されるレッスンの品質、正確性、信頼性、有用性等については自ら判断するものとし、これらを自己の責任において利用することにあらかじめ同意するものとします。</li>
					<li>受講者は、レッスン契約を申し込む前に、レッスンを提供する講師について情報を十分に確認してからレッスン契約の申込を行うものとし、講師の身元や提供するレッスンの内容等に疑問がある場合は、本サービス上の講師へのメール機能を使って直接講師に問い合わせるものとします。</li>
					<li>レッスンは原則として講師により提供されるものとし、当社は、当社が別途必要と認めた場合を除いては、レッスンを提供しないものとします。</li>
					<li>受講者は、講師によっては音声のみでのレッスンとなる場合があること及び講師毎に発音に差異があることについて、あらかじめ同意するものとします。</li>
					<li>当社は、講師により提供されるレッスン及び講師と受講者との間において相互に提供される情報の査定や管理は一切行わないものとします。</li>
					<li>当社は、講師の身元情報その他講師が掲示する諸情報の真実性、正確性、確実性、信頼性、有益性等については、一切保証しないものとします。</li>
					<li>当社は、講師の作為又は不作為により受講者又は第三者が損害又は損失等を被ったとしても、一切の責任を負わないものとします。</li>
					<li>当社は、受講者と講師との間で相互に提供されるいかなる情報、ファイル及び物品等について一切責任を負わないものとし、受講者は、これらの情報、ファイル又は物品等の提供によって受講者に生じたいかなる種類の損害又は損失等からも当社を免責することにあらかじめ同意するものとします。</li>
				</ol>
			</li>

			<li>他の受講者等とのトラブル<br>受講者は、万が一、他の受講者、講師その他の第三者から何らかの被害や迷惑を被る等受講者と他の受講者、講師その他の第三者との間でトラブルが生じた場合には、自己の責任と費用をもってその処理解決を図るものとし、当該トラブルに関連して当社が損害を被った場合には、その全ての損害（合理的な弁護士費用を含みますがこれに限りません。）を直ちに賠償する責任を負うものとします。なお、当社が当該トラブルを処理解決した場合には、その処理解決に要した全ての費用（合理的な弁護士費用を含みますがこれに限りません。）は、受講者の負担とします。</li>

			<li>受講者登録
				<ol>
					<li>受講者は、当社サイト上の受講者登録ページの入力フォームに自己の氏名、性別、電子メールアドレス、希望パスワード、居住国その他当社が別途指定する情報を入力し、これを当社に送信する方法その他当社が別途指定する方法により受講者登録申込（以下、「受講者登録申込」といいます。）を行うものとします。なお、受講者は、当社が別途認める場合を除き、受講者登録申込を第三者に行わせてはならないものとします。</li>
					<li>受講者は、受講者登録申込の際、虚偽の内容を入力してはならないものとします。</li>
					<li>当社は、受講者に対し、受講者登録申込を承諾する旨の電子メールを送信する方法その他当社が別途定める方法により受講者登録申込を承諾するものとします。</li>
					<li>当社は、以下の各号のいずれかに該当する場合、その理由を開示することなく、受講者登録申込を承諾しないことができるものとします。
						<ol class="non-number">
							<li>① 受講者登録申込が受講者以外の第三者により行われたことが判明した場合（但し、当社が別途認める場合を除きます。）</li>
							<li>② 受講者登録申込時に入力された内容に虚偽、誤記、入力漏れがあったことが判明した場合</li>
							<li>③ 受講者が過去に本規約違反等により受講者登録の抹消処分等を受けていたことが判明した場合</li>
							<li>④ その他、受講者登録申込を承諾することが不適切であると当社が判断した場合</li>
						</ol>
					</li>
					<li>受講者は、受講者登録申込時に入力した氏名、電子メールアドレス、居住国その他当社が別途指定する情報に変更が生じた場合、当社が別途定める方法により直ちに当社に届け出るものとします。</li>
					<li>受講者は、当社が別途定める手続により受講者登録を自ら抹消することができるものとします。なお、本項本文に基づき受講者登録が抹消された時点で受講者が保有する未受講レッスンの受講料は当該時点で消滅するものとし、その払戻は行わないものとします。</li>
				</ol>
			</li>
			
			<li>メールマガジンサービス
				<ol>
					<li>受講者は、受講者登録申込の際に、メールマガジンサービスの提供を受けるか否かの選択をすることができものとします。　※中澤さんに確認</li>
					<li>受講者は、メールマガジンサービスにより配信される電子メール（以下、「メールマガジン」といいます。）に広告主の広告が含まれることがあることにあらかじめ同意するものとします。</li>
					<li>当社は、当社が必要であると判断した範囲でメールマガジンサービスを提供するものであって、定期的に又は受講者全員に対してメールマガジンを配信することを保証するものではなく、受講者は、当社がメールマガジンサービスを提供し得ない場合又は提供しない場合があることにあらかじめ同意するものとします。</li>
					<li>受講者は、当社が別途定める手続によりメールマガジンの配信を拒否することができるものとします。</li>
				</ol>
			</li>

			<li>本サービス提供の停止・当社による受講者登録の抹消<br>当社は、受講者が以下の各号のいずれかに該当する場合、事前に通知することなく、当該受講者に対する本サービスの提供を停止し、又は受講者登録の抹消を行うことができるものとします。なお、本条本文に基づき受講者登録が抹消された時点で未受講レッスンの受講料は当該時点で消滅するものとし、その払戻は行わないものとします。
				<ol class="non-number">
					<li>① 過去に本規約違反等により受講者登録の抹消処分等を受けていたことが判明した場合</li>
					<li>② 第16条各号に定める行為を行った場合</li>
					<li>③ 前二号に定める他、本規約に違反した場合</li>
					<li>④ その他、本サービスを提供し、又は受講者登録を維持することが不適切であると当社が判断した場合</li>
				</ol>
			</li>

			<li>パスワードの管理・使用等
				<ol>
					<li>受講者は、当社が受講者に発行したパスワード（以下、「パスワード」といいます。）の管理及び使用について一切の責任を負うものとします。</li>
					<li>受講者は、当社が別途認める場合を除き、パスワードを第三者に譲渡、貸与若しくは開示し、又は使用させてはならないものとします。</li>
					<li>パスワードの使用上の過誤又は第三者の不正使用等による不利益、損害、改ざん等については、当該パスワードを保有する受講者が一切の責任を負うものとし、当社は一切の責任を負わないものとします。</li>
					<li>受講者は、パスワードが第三者により無断で使用される等の不正使用がなされていることを発見した場合、当社へ直ちに連絡するものとし、当社から指示がある場合はこれに従うものとします。</li>
				</ol>
			</li>

			<li>費用負担
				<ol>
					<li>受講者は、本サービスを利用し、又はレッスンを受講するために必要なハードウェア（PC、ヘッドセット、マイク、イヤホン等を含みますがこれらに限りません。）、ソフトウェア（後記第17条第1項に定める通話ソフトウェアを含みますがこれに限りません。）、通信回線その他の一切を自己の責任と費用をもって準備するものとします。</li>
					<li>受講者は、本サービスの利用又はレッスンの受講には、前項に定める他、電話代等の通信費用、インターネットへの接続費用、電気代その他の費用がかかることを了承し、これを負担するものとします。</li>
				</ol>
			</li>

			<li>レッスン契約の成立等
				<ol>
					<li>レッスン契約は、受講者によるレッスン契約の申込に対し、講師が、本サービス上のシステムを利用して、当該申込を承諾する旨の電子メールを送信した時点で成立するものとします。</li>
					<li>受講者は、当社が別途定める「キャンセルポリシー（講師向け）」に基づき講師が受講者によるレッスン契約の申込を承諾せず、又は、成立後のレッスン契約をキャンセルすることができることにあらかじめ同意するものとします。</li>
				</ol>
			</li>

			<li>レッスン料金の支払いについて
				<ol>
					<li>受講者はレッスンを受講するにあたって、当社に受講料として支払うものとします。</li>
					<li>受講者は、レッスン申込の際、虚偽の内容を入力してはならないものとします。</li>
					<li>受講料は、受講者本人名義のクレジットカード（当社が別途指定するクレジットカード会社が発行するものに限るものとします。）による支払、銀行振込による支払、コンビニ決済による支払その他当社が別途指定する方法により支払うものとします。</li>
					<li>受講者は、受講申込をした後は、当社が別途認める場合を除いて受講申込を撤回又は取り消すことができないことにあらかじめ同意するものとします。</li>
				</ol>
			</li>

			<li>受講料の返還について
				<ol>
					<li>受講者によるレッスン契約の申込又は成立後のレッスン契約のキャンセル又はレッスン時間の変更の可否、キャンセルがなされた場合のサービスフィー受講料の返還の取扱等については、当社が別途定める「キャンセルポリシー（受講者向け）」に従うものとします。</li>
					<li>本条第1項で定める他、以下の各号のいずれかに該当する事態が発生した場合、受講者は当社に受講料の返還を求めることができるものとします。
						<ol class="non-number">
							<li>① 成立後のレッスン契約が当社側又は講師側のみの都合でキャンセルされ、その事実に基づき受講者が当社に対して受講料の返還を請求した場合</li>
							<li>② レッスン中に講師側のみに起因する事由によりレッスン契約で定められていたレッスン時間のうち累計20％に相当する時間分のレッスンの遂行が妨げられ、その事実に基づき受講者が受講料の返還を請求した場合</li>
						</ol>
					</li>
					<li>当社は、以下の各号のいずれかに該当する場合、受講者に対し、当社が必要と判断する情報の提供を請求することができるものし、受講者は当該請求に直ちに応じなければならないものとします。
						<ol class="non-number">
							<li>① 受講者又は講師が成立後のレッスン契約をキャンセルした場合</li>
							<li>② レッスン契約で定められていたレッスン時間のうち累計20％に相当する時間分のレッスンの遂行が妨げられた場合又はその可能性があると当社が判断した場合</li>
							<li>③ 講師が講師規約に違反し、又は違反している可能性があると当社が判断した場合</li>
							<li>④ その他、当社が必要と判断した場合</li>
						</ol>
					</li>
					<li>本条第2項各号に該当する事態が発生したか否かについては、当社が受講者及び講師双方に対し最大の誠意を持って調査した結果、当社が最終的に判断することとし、受講者及び講師はこれに従うものとします。</li>
					<li>本条第1項又は本条第2項に定める場合であっても、対象となったレッスン契約に関連して受講者が本規約に違反していた事実が判明した場合には、受講料の返還は行わないものとします。</li>
				</ol>
			</li>

			<li>受講料の払戻の禁止<br>第25条第2項に定める場合を除き、受講料の払戻は行わないものとします。</li>

			<li>禁止事項
				<ol>
					<li>受講者は、本サービスの利用又はレッスンの受講に関連して、以下の各号の行為を行わないものとします。
						<ol class="non-number">
							<li>① 事実に反する情報を送信又は掲示する行為</li>
							<li>② 本サービスにより利用しうる情報を改ざん又は消去する行為又はそれを試みる行為</li>
							<li>③ 他の受講者、講師その他の第三者若しくは当社の著作権、商標権等の知的財産権を侵害する行為又は侵害するおそれのある行為</li>
							<li>④ 他の受講者、講師その他の第三者若しくは当社を差別若しくは誹謗中傷し、又は他の受講者その他の第三者若しくは当社の名誉若しくは信用を傷つける行為</li>
							<li>⑤ 他の受講者、講師その他の第三者若しくは当社の財産、プライバシー、肖像権若しくはパブリシティ権を侵害する行為又は侵害するおそれのある行為</li>
							<li>⑥ 他の受講者、講師その他の第三者若しくは当社に対して無断で広告、宣伝、勧誘等の電子メールを送信する行為、受信者が嫌悪感を抱く電子メールを送信する行為、他者の電子メール受信を妨害する行為、連鎖的な電子メール転送を第三者に依</li>頼する行為又は当該依頼に応じて電子メール転送を行う行為
							<li>⑦ 詐欺等の犯罪に結びつく行為</li>
							<li>⑧ 無限連鎖講（ネズミ講）を開設し、又はそれを勧誘する行為</li>
							<li>⑨ わいせつ又は児童虐待にあたる画像、文書等を送信又は掲示する行為</li>
							<li>⑩ 選挙運動若しくはこれに類似する行為又は公職選挙法に違反する行為</li>
							<li>⑪ コンピュータウイルス等有害なプログラムを使用若しくは提供する行為又は第三者に推奨する行為</li>
							<li>⑫ 他の受講者、講師その他の第三者になりすまして、本サービスを利用する行為</li>
							<li>⑬ 本サービスに接続されている他のコンピュータシステム又はネットワークへの不正アクセスを試みる行為</li>
							<li>⑭ 前各号に定める他、法令若しくは公序良俗に反する行為（売春、暴力、残虐行為等を含みますがこれらに限りません。）又は他の受講者、講師その他の第三者若しくは当社に不利益を与える行為</li>
							<li>⑮ 他の受講者、講師その他の第三者に対して本サービスと競合し、又は競合する可能性のあるサービスを紹介、斡旋等する行為</li>
							<li>⑯ 前各号に定める行為を助長又は促進する行為</li>
							<li>⑰ その他、当社が不適切と判断した行為</li>
						</ol>
					</li>
					<li>受講者は、受講者登録中はもちろん受講者登録抹消後であっても、本サービスに関連して知り得た講師に関する情報を本サービスの利用及びマッチングサービスにより締結されたレッスン契約の履行以外の目的に使用してはならず、当該情報に含まれる講師に対してマッチングサービスを利用することなく直接のレッスンの申込等を一切行ってはならないものとします。</li>
				</ol>
			</li>

			<li>通話ソフトウェアの利用　※サイト仕様確認後見直し必要
				<ol>
					<li>受講者は、レッスンを受講する際、第三者の提供する当社指定のオンライン通話ソフトウェア（以下、「通話ソフトウェア」といいます。）を使用するものとします。</li>
					<li>受講者は、通話ソフトウェアを使用する際には、通話ソフトウェアを提供する第三者の定める利用規約、使用条件その他の定めに従うものとします。</li>
					<li>受講者は、受講者登録を行う前に、あらかじめ通話ソフトウェアをダウンロードし、受講者の環境下で通話ソフトウェアが使用可能かどうかを確認しなければならないものとします。</li>
					<li>当社は、受講者の環境下で通話ソフトウェアが使用できなかったこと、通話ソフトウェアの使用に必要なハードウェアの故障及び設定不備その他受講者側の事由により受講者がレッスンを受講できなかったとしても、一切の責任を負わないものとします。</li>
				</ol>
			</li>

			<li>電子メール・アップロードされた情報等
				<ol>
					<li>当社は、受講者、講師その他の第三者が作成した電子メール又はアップロードされた情報等の内容については、一切の責任を負わないものとします。</li>
					<li>受講者の電子メール送信、情報等のアップロード、電子メールのサービスプロバイダとの対応及び当該対応に関連する他の条件、保証又は表明については、受講者が一切の責任を負うものとし、受講者は、当該対応の結果としてのいかなる種類の損害又は損失等から当社を免責することに同意するものとします。</li>
				</ol>
			</li>

			<li>秘密情報等の取扱
				<ol>
					<li>受講者は、受講登録申込の際その他当社が別途指定する機会に、本サービスの利用及びレッスンの受講に必要な情報として当社が別途指定する受講者の個人情報その他受講者に関する情報（以下、「個人情報等」といいます。）を当社に提供するものとします。当社は、個人情報等のうち当社が別途入力フォーム等において講師に知らせる目的で本サイト上に掲示することを明示した上で当該掲示を行うことにつき受講者からあらかじめ同意を得た情報を、本サイト上に掲示するものとします。</li>
					<li>本規約に特に定める他、受講者は、受講者登録中はもちろん受講者登録抹消後であっても、本サービスの利用又はレッスンの受講に関連して得られた他の受講者、講師その他の第三者及び当社に関する一切の情報について、その秘密を厳重に保持するものとし、方法の如何を問わず、これを第三者に開示あるいは漏洩し、また、本サービスの利用及びマッチングサービスにより締結されたレッスン契約の履行以外の目的のために使用してはならないものとします。</li>
					<li>本規約3に特に定める他、受講者は、本サービスと競合し、又は競合する可能性のあるサービスに関する情報を、当社サイト又はレッスンを通じて他の受講者、講師その他の第三者に提供しないものとします。</li>
				</ol>
			</li>

			<li>ライセンス権の許諾<br>受講者は、当社に対し、受講者が当社サイトのプロフィールページその他のウェブページにアップロードした情報（これらの情報から発生又は派生する情報を含みますがこれに限りません。）を全世界で使用、公開、表示、再生、修正、翻訳、配布、削除等するサブライセンス権付き非独占的ライセンス権を、無償かつ永続的に許諾するものとします。なお、本条本文に基づき当社が受講者からライセンス権の許諾を受ける情報には、テキスト、写真、絵画、音楽、評価を含め受講者が当社サイトのプロフィールページその他のウェブページにアップロードした個人情報以外の全ての情報が含まれるものとします。</li>

			<li>非保証・免責
				<ol>
					<li>当社は、本サービスにおいて提供する情報の真実性、正確性、確実性、信頼性、有用性等その他本サービス及びレッスンの品質、信頼性、有用性等について、いかなる保証も行わないものとし、受講者がこれらに関連して被った損害又は損失等について、一切の責任を負わないものとします。</li>
					<li>当社は、本サービスの提供の停止、受講者登録の抹消、本サービスの中断、変更、追加、廃止等により受講者が被った損害又は損失等について、一切の責任を負わないものとします。</li>
					<li>当社は、受講者が他の受講者を含む第三者の作為又は不作為により被った損害又は損失等について、一切の責任を負わないものとします。</li>
					<li>本規約に特に定める他、当社は、本サービスの利用又はレッスンの受講に関連して受講者が被った損害又は損失等について、一切の責任を負わないものとします。</li>
					<li>当社は、受講者が本サービスの利用又はレッスンの受講に関連して他の受講者、講師その他の第三者に与えた損害又は損失等について、一切の責任を負わないものとします。</li>
				</ol>
			</li>

			<li>広告主等との関係
				<ol>
					<li>受講者は、本サイト内に掲載される広告の広告主その他の事業者（以下、「広告主等」といいます。）の販促行動に参加する場合、受講者と広告主等との間において生じるトラブル等については、全て受講者と広告主等との間で処理解決されるべきものであることに同意するものとします。</li>
					<li>当社は、広告主等が設置するリンク、広告主等が運営するウェブサイト又は本サービス若しくはソフトウェアの使用により受講者が接触し連絡する者を含む第三者によるあらゆる行為について一切の責任を負わないものとします。</li>
					<li>受講者は、広告主等その他の第三者が受講者に与えたいかなる損害又は損失等についても、当社を免責することにあらかじめ同意するものとします。</li>
				</ol>
			</li>

			<li>本サービス提供の中断<br>当社は、次のいずれかに該当する場合には、受講者に事前に通知することなく、本サービスの提供を一時的に中断することができるものとします。
				<ol class="non-number">
					<li>① 本サービス用設備の保守又は工事のため、やむを得ない場合</li>
					<li>② 本サービス用設備に障害が発生し、やむを得ない場合</li>
					<li>③ 電気通信事業者の提供する電気通信役務に起因して電気通信サービスの利用が不能になった場合</li>
					<li>④ その他、運用上又は技術上当社が本サービスの一時的中断が必要と判断した場合</li>
				</ol>
			</li>

			<li>本サービスの内容の変更・追加<br>当社は、受講者に事前に通知することなく、本サービスの内容を変更又は追加することができるものとします。</li>

			<li>本サービスの廃止
				<ol>
					<li>当社は、受講者に通知することにより、本サービスを廃止することができるものとします。</li>
					<li>当社は、本サービスを廃止した場合には、本サービス廃止時に受講者が保有する未使用受講料について、当社が別途定める金額を当社が別途定める方法により払い戻すものとします。</li>
				</ol>
			</li>

			<li>権利の帰属<br>当社がメールマガジンサービスにより配信する情報その他の本サービスにおいて提供する情報等（映像、音声、文章、写真、画像等を含みますがこれらに限りません。）に関する著作権、商標権等の知的財産権、肖像権、パブリシティ権その他一切の権利は、別段の定めがない限り、全て当社に帰属するものとします。</li>

			<li>本規約等の改定
				<ol>
					<li>当社は、受講者の承諾を得ることなく、本規約、当社が定める利用規約等を改定することができるものとします。</li>
					<li>改定後の本規約、当社が定める利用規約等は、当社が受講者に対してその改定内容を通知した時点から第3条第2項に従いその効力を生じるものとします。</li>
				</ol>
			</li>

			<li>消費者契約法との関係<br>本規約の各条項は、消費者契約法（平成12 年5 月12 日法律第61 号。以下、「消費者契約法」といいます。）の各条項と矛盾又は抵触する部分については、その効力を生じないものとします。なお、本条本文により効力を生じない部分は、消費者契約法の各条項と矛盾又は抵触する一部分に限られるものとし、当該一部分を含む各条項のうちの他の部分及び当該条項以外の他の条項については、何らの影響を受けることなくその効力が存続するものとします。</li>

			<li>損害賠償<br>本規約に特に定める他、受講者は、本規約に違反したことにより、又は故意若しくは過失により、当社に損害を与えた場合、当社に対し、その全ての損害（合理的な弁護士費用を含みますがこれに限りません。）を直ちに賠償する責任を負うものとします。</li>

			<li>権利義務の移転・担保提供の禁止<br>受講者は、本規約に基づく権利義務の全部若しくは一部を第三者に譲渡若しくは承継し、又は担保に供してはならないものとします。</li>

			<li>準拠法<br>本規約に関する準拠法は、日本法とします。</li>

			<li>管轄裁判所<br>受講者及び当社は、本サービスに関連して受講者と当社との間又は受講者と講師との間で訴訟の必要が生じた場合、その訴額に応じて東京地方裁判所又は東京簡易裁判所を第一審の専属的合意管轄裁判所とすることに合意するものとします。</li>

			<li>存続条項<br>受講者登録抹消後といえども、第2条、第3条、第5条第1項、第2項、第5項、第8項、及び第9項、第6条、第7条第6項、第8条第2項及び第3項、第9条なお書、第10条、第11条、第14条第4項及び第5項、第15条、第16条第2項、第17条第4項、第18条ないし第22条、第26条、第28条ないし本条の各規定はなお有効に存続するものとします。</li>

			<li>協議解決<br>本規約に定めのない事項又は本規約の解釈について疑義が生じた事項については、受講者と当社とで誠意をもって協議の上、解決にあたるものとします。</li>
		</ol>
		<p class="u-mt30">2020年10月1日　制定・施行</p>
	</div>
</div>

@endsection